#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.eventBridgeRule1.aws_cloudwatch_event_rule.cron-job: Refreshing state... [id=twitter-search-20220517233759738000000002]
module.dynamoDB.aws_dynamodb_table.twitter-auth-dynamoDB: Refreshing state... [id=twitter-auth]
module.eventBridgeRule2.aws_cloudwatch_event_rule.cron-job: Refreshing state... [id=twitter-search-20220517234211222200000001]
module.authorisation-lambda.aws_cloudwatch_log_group.twitter-auth-cloudwatch: Refreshing state... [id=/aws/lambda/twitter-auth-lambda]
module.authorisation-lambda.aws_apigatewayv2_api.twitter-auth-api-gateway: Refreshing state... [id=pw7fshn6z7]
module.twitter-bot-lambda.aws_cloudwatch_log_group.twitter-auth-cloudwatch: Refreshing state... [id=/aws/lambda/twitter-bot-lambda]
module.eventBridgeRule0.aws_cloudwatch_event_rule.cron-job: Refreshing state... [id=twitter-search-20220517233759738000000001]
module.authorisation-lambda.aws_iam_role.iam-role-authorisation-lambda: Refreshing state... [id=iam-role-authorisation-lambda]
module.twitter-bot-lambda.aws_iam_role.iam-role-twitter-bot-lambda: Refreshing state... [id=iam-role-twitter-bot-lambda]
module.twitter-bot-lambda.aws_iam_policy.cloudwatch-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-bot-cloudwatch]
module.authorisation-lambda.aws_iam_policy.cloudwatch-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-authorisation-cloudwatch]
module.dynamoDB.aws_iam_policy.dynamoDB-read-write-access-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/dynamoDB-read-write-access-policy]
module.authorisation-lambda.aws_apigatewayv2_stage.twitter-auth-api-gateway-stage: Refreshing state... [id=$default]
module.authorisation-lambda.aws_iam_policy.twitter-auth-api-gateway-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-auth-api-gateway-policy]
module.authorisation-lambda.aws_lambda_function.twitter-authorisation-lambda: Refreshing state... [id=twitter-auth-lambda]
module.authorisation-lambda.aws_iam_policy_attachment.cloudwatch-policy-attachment: Refreshing state... [id=twitter-authorisation-cloudwatch]
module.dynamoDB.aws_iam_policy_attachment.dynamoDB-read-write-access-policy-attachment: Refreshing state... [id=dynamoDB-read-write-access]
module.twitter-bot-lambda.aws_iam_policy_attachment.cloudwatch-policy-attachment: Refreshing state... [id=twitter-bot-cloudwatch]
module.twitter-bot-lambda.aws_lambda_function.twitter-bot-lambda: Refreshing state... [id=twitter-bot-lambda]
module.authorisation-lambda.aws_apigatewayv2_integration.twitter-auth-api-gateway-lambda-integration: Refreshing state... [id=8sq64tk]
module.authorisation-lambda.aws_lambda_permission.api-gateway-lambda-permission: Refreshing state... [id=APIGatewayToLambda]
module.eventBridgeRule2.aws_cloudwatch_event_target.cron-json: Refreshing state... [id=twitter-search-20220517234211222200000001-terraform-20220517234211469500000003]
module.eventBridgeRule2.aws_lambda_permission.lambda-trigger: Refreshing state... [id=lambda-trigger-20220517234211468400000002]
module.eventBridgeRule0.aws_lambda_permission.lambda-trigger: Refreshing state... [id=lambda-trigger-20220517233759990200000005]
module.eventBridgeRule1.aws_lambda_permission.lambda-trigger: Refreshing state... [id=lambda-trigger-20220517233759982200000003]
module.eventBridgeRule1.aws_cloudwatch_event_target.cron-json: Refreshing state... [id=twitter-search-20220517233759738000000002-terraform-20220517233759983100000004]
module.eventBridgeRule0.aws_cloudwatch_event_target.cron-json: Refreshing state... [id=twitter-search-20220517233759738000000001-terraform-20220517233759991400000006]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-authorise-route: Refreshing state... [id=kw7ncm6]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-token-route: Refreshing state... [id=avfb6rd]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-refresh-route: Refreshing state... [id=5qjtwor]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.dynamoDB.aws_dynamodb_table.twitter-auth-db will be created
  + resource "aws_dynamodb_table" "twitter-auth-db" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "twitter-auth"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

  # module.dynamoDB.aws_dynamodb_table.twitter-auth-dynamoDB will be destroyed
  # (because aws_dynamodb_table.twitter-auth-dynamoDB is not in configuration)
  - resource "aws_dynamodb_table" "twitter-auth-dynamoDB" {
      - arn            = "arn:aws:dynamodb:eu-west-2:388331548819:table/twitter-auth" -> null
      - billing_mode   = "PAY_PER_REQUEST" -> null
      - hash_key       = "id" -> null
      - id             = "twitter-auth" -> null
      - name           = "twitter-auth" -> null
      - read_capacity  = 0 -> null
      - stream_enabled = false -> null
      - tags           = {} -> null
      - tags_all       = {} -> null
      - write_capacity = 0 -> null

      - attribute {
          - name = "id" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - attribute_name = "ttl" -> null
          - enabled        = true -> null
        }
    }

  # module.dynamoDB.aws_dynamodb_table.twitter-history-db will be created
  + resource "aws_dynamodb_table" "twitter-history-db" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "twitter-history"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @MugishaU, Action: `pull_request`*